arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_adc_hal.h
/*!
 * @brief Sets the Hardware Average Enable Flag state
 *
 * This function configures the Hardware Average Enable Flag.
 * Hardware averaging can be used to obtain an average value
 * over multiple consecutive conversions on the same channel.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] state the new Hardware Average Enable Flag state
 */
static inline void ADC_HAL_SetHwAverageEnableFlag(ADC_Type* const baseAddr, const bool state)
{
    uint32_t tmp = baseAddr->SC3;
    /* Clear the affected bitfield and write '0' to the w1c bits to avoid side-effects */
    tmp &= ~(ADC_SC3_CALF_MASK | ADC_SC3_AVGE_MASK);
    tmp |= ADC_SC3_AVGE((uint32_t)state);
    baseAddr->SC3 = tmp;
}

/*!
 * @brief Gets the Hardware Average Mode
 *
 * This function returns the configured Hardware Average Mode.
 * The mode selects the number of samples to average: 4, 8, 16
 * or 32.
 *
 * @param[in] baseAddr adc base pointer
 * @return the Hardware Average Mode selection. Possible values:
 *        - ADC_AVERAGE_4 : Hardware average of 4 samples..
 *        - ADC_AVERAGE_8 : Hardware average of 8 samples.
 *        - ADC_AVERAGE_16 : Hardware average of 16 samples.
 *        - ADC_AVERAGE_32 : Hardware average of 32 samples.
 */
static inline adc_average_t ADC_HAL_GetHwAverageMode(const ADC_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->SC3;
    tmp = (tmp & ADC_SC3_AVGS_MASK) >> ADC_SC3_AVGS_SHIFT;
    return (adc_average_t)(tmp);
}

/*!
 * @brief Sets the Hardware Average Mode
 *
 * This function configures the Hardware Average Mode. The
 * mode selects the number of samples to average: 4, 8, 16
 * or 32.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] averageMode the new Hardware Average Mode.
 *        - ADC_AVERAGE_4 : Hardware average of 4 samples..
 *        - ADC_AVERAGE_8 : Hardware average of 8 samples.
 *        - ADC_AVERAGE_16 : Hardware average of 16 samples.
 *        - ADC_AVERAGE_32 : Hardware average of 32 samples.
 */
static inline void ADC_HAL_SetHwAverageMode(ADC_Type* const baseAddr, const adc_average_t averageMode)
{
    uint32_t tmp = baseAddr->SC3;
    /* Clear the affected bitfield and write '0' to the w1c bits to avoid side-effects */
    tmp &= ~(ADC_SC3_CALF_MASK | ADC_SC3_AVGS_MASK);
    tmp |= ADC_SC3_AVGS(averageMode);
    baseAddr->SC3 = tmp;
}

/*! @}*/

/*!
 * @name Automatic Calibration.
 * Functions configure and use the Automatic Calibration feature.
 */
/*! @{*/

/*!
 * @brief Gets the Calibration Active Flag state
 *
 * This function returns the state of the Calibration Active
 * Flag. This flag is set if an Auto-Calibration sequence is
 * taking place.
 *
 * @param[in] baseAddr adc base pointer
 * @return the Calibration Active Flag state
 */
static inline bool ADC_HAL_GetCalibrationActiveFlag(const ADC_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SC3), ADC_SC3_CAL_SHIFT);
}

/*!
 * @brief Sets the Calibration Active Flag state
 *
 * This functions starts or aborts an Auto-Calibration
 * sequence. If this is set, it will remain set until the
 * sequence is finished.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] state the new Calibration Active Flag state
 */
static inline void ADC_HAL_SetCalibrationActiveFlag(ADC_Type* const baseAddr, const bool state)
{
    uint32_t tmp = baseAddr->SC3;
    /* Write '0' to the w1c bits to avoid side-effects */
    tmp &= ~(ADC_SC3_CALF_MASK);
    tmp |= ADC_SC3_CAL((uint32_t)state);
    baseAddr->SC3 = tmp;
}

/*!
 * @brief Sets the Calibration Failed Flag state
 *
 * This function returns the state of the Calibration Failed
 * Flag. This flag is set if an Auto-Calibration sequence failed
 * or was aborted.
 *
 * @param[in] baseAddr adc base pointer
 * @return the Calibration Failed Flag state
 */
static inline bool ADC_HAL_GetCalibrationFailedFlag(const ADC_Type* const baseAddr)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SC3), ADC_SC3_CALF_SHIFT);
}

/*!
 * @brief Gets the User Gain Register value
 *
 * This function returns the value in the User Gain Register.
 * The value in this register is the amplification applied
 * to the measured data before being written in the result
 * register.
 *
 * @param[in] baseAddr adc base pointer
 * @return the User Gain Register value
 */
static inline uint16_t ADC_HAL_GetUserGainValue(const ADC_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->UG;
    tmp = (tmp & ADC_UG_UG_MASK) >> ADC_UG_UG_SHIFT;
    return (uint16_t)tmp;
}

/*!
 * @brief Sets the User Gain Register value
 *
 * This function configures the User Gain Register. The value
 * in this register is the amplification applied to the
 * measured data before being written in the result register.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] value the new User Gain Register value
 */
static inline void ADC_HAL_SetUserGainValue(ADC_Type* const baseAddr, const uint16_t value)
{
    uint16_t clp0 = baseAddr->CLP0;
    uint16_t clp1 = baseAddr->CLP1;
    uint16_t clp2 = baseAddr->CLP2;
    uint16_t clp3 = baseAddr->CLP3;
    uint16_t clps = baseAddr->CLPS;
    /* Add CLP0, CLP1, CLP2, CLP3 and CLPS */
    uint16_t sum = value + clp0 + clp1 + clp2 + clp3 + clps;
    /* If OR of bits [15:11] from the sum is 1 (set), write 0xFFFFU to Gain register */
    uint16_t temp = sum & 0xF800U;
    if (temp != 0x0000U){
        temp = 0xFFFFU;
    }
    baseAddr->UG = (uint32_t)value;
    baseAddr->G = (uint32_t)temp;
}

/*!
 * @brief Gets the User Offset Register value
 *
 * This function returns the value in the User Offset Register.
 * The value in this register is subtracted from the measured
 * data before being written in the result register. This value
 * is 16-bit signed value. To preserve resolution, lower-order
 * bits will be ignored in low resolution-modes.
 *
 * @param[in] baseAddr adc base pointer
 * @return the User Offset Register value
 */
static inline uint16_t ADC_HAL_GetUserOffsetValue(const ADC_Type* const baseAddr)
{
    uint32_t tmp = baseAddr->USR_OFS;
    tmp = (tmp & ADC_USR_OFS_USR_OFS_MASK) >> ADC_USR_OFS_USR_OFS_SHIFT;
    return (uint16_t)tmp;
}

/*!
 * @brief Sets the User Offset Register value
 *
 * This function configures the User Offset Register. The value
 * in this register is subtracted from the measured data before
 * being written in the result register. This value is 16-bit
 * signed value. To preserve resolution, lower-order bits
 * will be ignored in low resolution-modes.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] value the new User Offset Register value
 */
static inline void ADC_HAL_SetUserOffsetValue(ADC_Type* const baseAddr, const uint16_t value)
{
    baseAddr->USR_OFS = ADC_USR_OFS_USR_OFS(value);
}

/*! @}*/

/*!
 * @name Converter channels.
 * Functions to configure and access each ADC converter channel.
 */
/*! @{*/

/*!
 * @brief Gets the Channel Interrupt Enable state
 *
 * This function returns the state of the Channel Interrupt
 * Enable Flag. If the flag is set, an interrupt is generated
 * when the a conversion is completed for the channel.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @return the Channel Interrupt Enable Flag state
 */
static inline bool ADC_HAL_GetChanInterruptEnableFlag(const ADC_Type* const baseAddr, const uint8_t chanIndex)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SC1[chanIndex]), ADC_SC1_AIEN_SHIFT);
}

/*!
 * @brief Sets the Channel Interrupt Enable to a new state
 *
 * This function configures the state of the Interrupt Enable
 * Flag for a measurement channel. If the flag is set, an
 * interrupt is generated when the a conversion is completed
 * for the channel.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @param[in] state the new Channel Interrupt Enable Flag state
 */
static inline void ADC_HAL_SetChanInterruptEnableFlag(ADC_Type* const baseAddr, const uint8_t chanIndex, const bool state)
{
    BITBAND_ACCESS32(&(baseAddr->SC1[chanIndex]), ADC_SC1_AIEN_SHIFT) = state;
}

/*!
 * @brief Gets the configured input channel for the selected measurement channel
 *
 * This function returns the configured input channel for a
 * measurement channel.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @return the Input Channel selected for the Measurement Channel. Possible values:
 *        - ADC_INPUTCHAN_AD0 : AD0 selected as input.
 *        - ADC_INPUTCHAN_AD1 : AD1 selected as input.
 *        - ADC_INPUTCHAN_AD2 : AD2 selected as input.
 *        - ADC_INPUTCHAN_AD3 : AD3 selected as input.
 *        - ADC_INPUTCHAN_AD4 : AD4 selected as input.
 *        - ADC_INPUTCHAN_AD5 : AD5 selected as input.
 *        - ADC_INPUTCHAN_AD6 : AD6 selected as input.
 *        - ADC_INPUTCHAN_AD7 : AD7 selected as input.
 *        - ADC_INPUTCHAN_AD8 : AD8 selected as input.
 *        - ADC_INPUTCHAN_AD9 : AD9 selected as input.
 *        - ADC_INPUTCHAN_AD10 : AD10 selected as input.
 *        - ADC_INPUTCHAN_AD11 : AD11 selected as input.
 *        - ADC_INPUTCHAN_AD12 : AD12 selected as input.
 *        - ADC_INPUTCHAN_AD13 : AD13 selected as input.
 *        - ADC_INPUTCHAN_AD14 : AD14 selected as input.
 *        - ADC_INPUTCHAN_AD15 : AD15 selected as input.
 *        - ADC_INPUTCHAN_TEMP : Temp Sensor selected as input.
 *        - ADC_INPUTCHAN_BANDGAP : Band Gap selected as input.
 *        - ADC_INPUTCHAN_VREFSH : VREFSH selected as input.
 *        - ADC_INPUTCHAN_VREFSL : VREFSL selected as input.
 *        - ADC_INPUTCHAN_DISABLED : Channel Disabled.
 */
static inline adc_inputchannel_t ADC_HAL_GetInputChannel(const ADC_Type* const baseAddr, const uint8_t chanIndex)
{
    uint32_t tmp = baseAddr->SC1[chanIndex];
    tmp = (tmp & ADC_SC1_ADCH_MASK) >> ADC_SC1_ADCH_SHIFT;
    return (adc_inputchannel_t)(tmp);
}

/*!
 * @brief Sets the input channel configuration for the measurement channel.
 *
 * This function configures the input channel for a measurement
 * channel. In software trigger mode, configuring channel
 * A (index 0) will start a new conversion immediately.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @param[in] inputChan the Input Channel selected for the Measurement Channel
 *        - ADC_INPUTCHAN_AD0 : AD0 selected as input.
 *        - ADC_INPUTCHAN_AD1 : AD1 selected as input.
 *        - ADC_INPUTCHAN_AD2 : AD2 selected as input.
 *        - ADC_INPUTCHAN_AD3 : AD3 selected as input.
 *        - ADC_INPUTCHAN_AD4 : AD4 selected as input.
 *        - ADC_INPUTCHAN_AD5 : AD5 selected as input.
 *        - ADC_INPUTCHAN_AD6 : AD6 selected as input.
 *        - ADC_INPUTCHAN_AD7 : AD7 selected as input.
 *        - ADC_INPUTCHAN_AD8 : AD8 selected as input.
 *        - ADC_INPUTCHAN_AD9 : AD9 selected as input.
 *        - ADC_INPUTCHAN_AD10 : AD10 selected as input.
 *        - ADC_INPUTCHAN_AD11 : AD11 selected as input.
 *        - ADC_INPUTCHAN_AD12 : AD12 selected as input.
 *        - ADC_INPUTCHAN_AD13 : AD13 selected as input.
 *        - ADC_INPUTCHAN_AD14 : AD14 selected as input.
 *        - ADC_INPUTCHAN_AD15 : AD15 selected as input.
 *        - ADC_INPUTCHAN_TEMP : Temp Sensor selected as input.
 *        - ADC_INPUTCHAN_BANDGAP : Band Gap selected as input.
 *        - ADC_INPUTCHAN_VREFSH : VREFSH selected as input.
 *        - ADC_INPUTCHAN_VREFSL : VREFSL selected as input.
 *        - ADC_INPUTCHAN_DISABLED : Channel Disabled.
 */
static inline void ADC_HAL_SetInputChannel(ADC_Type* const baseAddr, const uint8_t chanIndex, const adc_inputchannel_t inputChan)
{
    uint32_t tmp = baseAddr->SC1[chanIndex];
    tmp &= ~(ADC_SC1_ADCH_MASK);
    tmp |= ADC_SC1_ADCH(inputChan);
    baseAddr->SC1[chanIndex] = tmp;
}

/*!
 * @brief Gets the measurement channel Conversion Complete Flag state
 *
 * This function returns the state of the Conversion Complete
 * Flag for a measurement channel. This flag is set when a conversion
 * is complete or the the condition generated by the Hardware
 * Compare feature is evaluated to true.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @return the Conversion Complete Flag state
 */
static inline bool ADC_HAL_GetConvCompleteFlag(const ADC_Type* const baseAddr, const uint8_t chanIndex)
{
    return (bool)BITBAND_ACCESS32(&(baseAddr->SC1[chanIndex]), ADC_SC1_COCO_SHIFT);
}

/*!
 * @brief Gets the conversion result for the selected measurement channel
 *
 * This function returns the conversion result from a
 * measurement channel. This automatically clears the
 * Conversion Complete Flag (CoCo flag) for that channel.
 *
 * @param[in] baseAddr adc base pointer
 * @param[in] chanIndex the adc measurement channel index
 * @return the Measurement Channel Conversion Result
 */
static inline uint16_t ADC_HAL_GetChanResult(const ADC_Type* const baseAddr, const uint8_t chanIndex)
{
    uint32_t tmp = baseAddr->R[chanIndex];
    tmp = (tmp & ADC_R_D_MASK) >> ADC_R_D_SHIFT;
    return (uint16_t)tmp;
}

/*! @}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_ADC_HAL_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/
